src/cf/BusinessProcesses/Подписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>Подписание</Name>
			<BasedOn>
				<xr:Item>Catalog.СообщенияОбсуждений</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.ТемыОбсуждений</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Файлы</xr:Item>
				<xr:Item>Catalog.ПроектныеЗадачи</xr:Item>
				<xr:Item>Document.Бронь</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИтераций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыполненияУчастниками</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВыполненияЭтапаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПрерывания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПодписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроцессаПодписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПодписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПодписанияПредметаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияПроцесса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУзелОбмена</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПредмета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредметаОснование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПротоколыМероприятий</v8:Type>
								<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
								<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
								<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
								<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПредмета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОснование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредметыЗадач</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Подписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредмета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступноУдаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбработок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерИтерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроцесса</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправленоНаПовторноеПодписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыПодписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроцесса</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИтерации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПодписания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроцессаПодписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантУстановкиСрокаИсполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУстановкиСрокаИсполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписывающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияДни</Name>
							<Comment>Срок исполнения для участника</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияМинуты</Name>
							<Comment>Срок исполнения для участника</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияЧасы</Name>
							<Comment>Срок исполнения для участника</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Подписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудозатратыПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭтапа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыполненияУчастниками</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыполненияЭтапаПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/Enums/ПорядокВыполненияЭтапаПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядокВыполненияЭтапаПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Параллельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последовательно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/BusinessProcesses/Подписание/Forms/ФормаИсторияПодписания/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СотрудникиПустаяСсылка = Справочники.Сотрудники.ПустаяСсылка();
	
	РаботаСБизнесПроцессамиВызовСервера.УстановитьФорматДаты(Элементы.ИсторияЦикловДатаИсполнения);
	РаботаСБизнесПроцессамиВызовСервера.УстановитьФорматДаты(Элементы.ИсторияИсполнителяДатаИсполнения);
	
	ЗадачаСсылка = Параметры.ЗадачаСсылка;
	БизнесПроцесс = ЗадачаСсылка.БизнесПроцесс;
	
	НомерИтерации = 0;
	
	НайденнаяСтрока = БизнесПроцесс.РезультатыПодписания.Найти(ЗадачаСсылка, "ЗадачаПроцесса");
	Если НайденнаяСтрока <> Неопределено Тогда 
		НомерИтерации = НайденнаяСтрока.НомерИтерации;
	Иначе	
		НомерИтерации = БизнесПроцесс.НомерИтерации;
	КонецЕсли;	
	  
	// заполнить дерево
	ДеревоИсторияИсполнителя = РеквизитФормыВЗначение("ИсторияИсполнителя");
	
	НомераИтераций = БизнесПроцесс.РезультатыПодписания.Выгрузить(,"НомерИтерации");
	НомераИтераций.Свернуть("НомерИтерации",);
	НомераИтераций.Сортировать("НомерИтерации Убыв");
	
	Если БизнесПроцесс.Этапы.Количество() = 0 Тогда
		Элементы.ИсторияИсполнителяПорядокСогласования.Видимость = Ложь;
	КонецЕсли;	
	
	Для Каждого СтрокаИтерации Из НомераИтераций Цикл
		
		Если СтрокаИтерации.НомерИтерации > НомерИтерации Тогда 
			Продолжить;
		КонецЕсли;	
		
		Если СтрокаИтерации.НомерИтерации = БизнесПроцесс.НомерИтерации Тогда // текущая итерация
			
			СтрокаДереваЦикл = ДеревоИсторияИсполнителя.Строки.Добавить();
			СтрокаДереваЦикл.Исполнитель = "Цикл " + СтрокаИтерации.НомерИтерации + НСтр("ru = ' (текущий)'");
			СтрокаДереваЦикл.НомерИтерации = СтрокаИтерации.НомерИтерации;
			
			Если БизнесПроцесс.Этапы.Количество() <> 0 Тогда
				ЭтапыПроцесса = БизнесПроцесс.Этапы;
			Иначе
				ЭтапыПроцесса = Новый ТаблицаЗначений;
				ЭтапыПроцесса.Колонки.Добавить("Идентификатор");
				ЭтапыПроцесса.Колонки.Добавить("НаименованиеЭтапа");
				ЭтапыПроцесса.Колонки.Добавить("ПорядокВыполненияУчастниками");
				ЭтапыПроцесса.Колонки.Добавить("Пройден");
				
				ФиктивныйЭтап = ЭтапыПроцесса.Добавить();
				ФиктивныйЭтап.Идентификатор = УникальныйИдентификаторПустой();
				ФиктивныйЭтап.НаименованиеЭтапа = НСтр("ru = 'Подписать'");
				ФиктивныйЭтап.ПорядокВыполненияУчастниками = Перечисления.ПорядокВыполненияЭтапаПроцесса.Параллельно;
				ФиктивныйЭтап.Пройден = Ложь;
				
			КонецЕсли;	
			
			Для Каждого Этап Из ЭтапыПроцесса Цикл
				
				ОднаСтрокаУчастников = БизнесПроцесс.Участники.Найти(Этап.Идентификатор, "Этап");
				Если ОднаСтрокаУчастников = Неопределено Тогда
					Продолжить; // если в этапе нет участников, не выводим его.
				КонецЕсли;	

				СтрокаДереваЭтап = СтрокаДереваЦикл.Строки.Добавить();
				СтрокаДереваЭтап.Исполнитель = Этап.НаименованиеЭтапа;
				СтрокаДереваЭтап.НомерИтерации = СтрокаИтерации.НомерИтерации;
				
				Для Каждого Строка Из БизнесПроцесс.Участники Цикл
					
					Если Строка.ТочкаМаршрута = БизнесПроцессы.Подписание.ТочкиМаршрута.ОбработатьРезультат Тогда
						Продолжить;
					КонецЕсли;	
					Если Строка.Этап <> Этап.Идентификатор Тогда
						Продолжить;
					КонецЕсли;	 
					
					ОтборСтрок = Новый Структура("Идентификатор, НомерИтерации",
						Строка.Идентификатор, НомерИтерации);
						
					НайденныеСтроки = БизнесПроцесс.РезультатыПодписания.НайтиСтроки(ОтборСтрок);
					РезПодписания = Неопределено;
					Если НайденныеСтроки.Количество() <> 0 Тогда
						РезПодписания = НайденныеСтроки[0];
					КонецЕсли;	

					СтрокаЗадачаИсполнителя = Неопределено;
					Если РезПодписания <> Неопределено Тогда
						СтрокаЗадачаИсполнителя = РезПодписания.ЗадачаПроцесса;
					КонецЕсли;
					
					СтрокаДереваИсполнитель = СтрокаДереваЭтап.Строки.Добавить();
					СтрокаДереваИсполнитель.ЗадачаИсполнителя = СтрокаЗадачаИсполнителя;
					
					Если Этап <> Неопределено Тогда
						СтрокаДереваИсполнитель.ПорядокВыполненияУчастниками = Этап.ПорядокВыполненияУчастниками;
						СтрокаДереваИсполнитель.Пройдена = Этап.Пройден;
					КонецЕсли;
					
					СтрокаДереваИсполнитель.НомерИтерации = БизнесПроцесс.НомерИтерации;
					
					СтрокаДереваИсполнитель.Исполнитель = Строка.Подписывающий;
					
					Если ЗначениеЗаполнено(СтрокаЗадачаИсполнителя) Тогда 
												
						Если СтрокаЗадачаИсполнителя.Выполнена Тогда
							СтрокаДереваИсполнитель.ДатаИсполнения = СтрокаЗадачаИсполнителя.ДатаИсполнения;
						КонецЕсли;                                                                            
						
						СтрокаДереваИсполнитель.РезультатВыполнения = СтрокаЗадачаИсполнителя.РезультатВыполнения;
						
						Если ЗначениеЗаполнено(СтрокаЗадачаИсполнителя.РольИсполнителя) Тогда 
							СтрокаДереваИсполнитель.ИсполнительПроцесса = СтрокаЗадачаИсполнителя.РольИсполнителя;
						Иначе					
							СтрокаДереваИсполнитель.ИсполнительПроцесса = СтрокаЗадачаИсполнителя.Исполнитель;
						КонецЕсли;
						
						Если РезПодписания <> Неопределено Тогда 
							СтрокаДереваИсполнитель.РезультатПодписания = РезПодписания.РезультатПодписания;
						КонецЕсли;
						
					Иначе
						СтрокаДереваИсполнитель.Исполнитель = Строка.Подписывающий;
					КонецЕсли;	
				КонецЦикла;	
				
			КонецЦикла;
			
		Иначе // история - прошлые циклы
			
			СтрокаДереваЦикл = ДеревоИсторияИсполнителя.Строки.Добавить();
			СтрокаДереваЦикл.Исполнитель = "Цикл " + СтрокаИтерации.НомерИтерации;
			СтрокаДереваЦикл.НомерИтерации = СтрокаИтерации.НомерИтерации;
			
			Для Каждого Строка Из БизнесПроцесс.РезультатыПодписания Цикл
				
				Если СтрокаИтерации.НомерИтерации <> Строка.НомерИтерации Тогда 
					Продолжить;
				КонецЕсли;	
				
				СтрокаЗадачаИсполнителя = Строка.ЗадачаПроцесса;
				
				СтрокаДереваИсполнитель = СтрокаДереваЦикл.Строки.Добавить();
				СтрокаДереваИсполнитель.ЗадачаИсполнителя = СтрокаЗадачаИсполнителя;
				
				СтрокаДереваИсполнитель.РезультатПодписания = Строка.РезультатПодписания;
				
				Если СтрокаЗадачаИсполнителя.Выполнена Тогда
					СтрокаДереваИсполнитель.ДатаИсполнения = СтрокаЗадачаИсполнителя.ДатаИсполнения;
				КонецЕсли;                                                                            					
				
				СтрокаДереваИсполнитель.РезультатВыполнения = СтрокаЗадачаИсполнителя.РезультатВыполнения;
				СтрокаДереваИсполнитель.НомерИтерации = Строка.НомерИтерации;
				СтрокаДереваИсполнитель.Пройдена = СтрокаЗадачаИсполнителя.Выполнена;
				
				СтрТаблУчастники = БизнесПроцесс.Участники.Найти(Строка.Идентификатор, "Идентификатор");
				Если СтрТаблУчастники <> Неопределено Тогда
					СтрокаДереваИсполнитель.Исполнитель = СтрТаблУчастники.Подписывающий;
				Иначе

					Если ЗначениеЗаполнено(СтрокаЗадачаИсполнителя.Исполнитель) Тогда 
						СтрокаДереваИсполнитель.Исполнитель = СтрокаЗадачаИсполнителя.Исполнитель;
					Иначе
						СтрокаДереваИсполнитель.Исполнитель = СтрокаЗадачаИсполнителя.РольИсполнителя;
					КонецЕсли;	
							
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаЗадачаИсполнителя.РольИсполнителя) Тогда 
					СтрокаДереваИсполнитель.ИсполнительПроцесса = СтрокаЗадачаИсполнителя.РольИсполнителя;
				Иначе					
					СтрокаДереваИсполнитель.ИсполнительПроцесса = СтрокаЗадачаИсполнителя.Исполнитель;
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;	
		
		
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ДеревоИсторияИсполнителя, "ИсторияИсполнителя");
	
	Элементы.ГруппаИсторияЦиклов.Видимость = Ложь;
	Элементы.ГруппаИсторияИсполнителя.Видимость = Истина;
	Заголовок = НСтр("ru = 'История подписания'");
	
	Если ТолькоПросмотр Тогда 
		Элементы.ИсторияИсполнителя.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементыДерева = ИсторияИсполнителя.ПолучитьЭлементы();
	
	Если ЭлементыДерева.Количество() > 0 Тогда 
		ЭлементДерева = ЭлементыДерева[0];
		Элементы.ИсторияИсполнителя.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторияИсполнителя

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
